---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsAttrNosingPlacement
source: html/054f07af-76d5-8ea6-d0f8-d49ca55d286a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsAttrNosingPlacement Property

"Apply Nosing Profile"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsAttrNosingPlacement { get; }
```